package task01.task0101.task0102;
/*
Написать программу, выводящую на экран надпись "Элли самая красивая" 5 раз. Каждый раз - с новой строки.
*/
public class Task1 {
    public static void main(String[] args) {
        for (int i = 0; i < 5; i++) {
            System.out.println("Элли самая красивая");
        }
    }

}
