package task01.task0101.task0110;

/*
* Объявить переменную name типа String
* Сразу же в строке объявления присвоить ей значение
* Вывести на экран переменную name
*/

public class VariableOnTheScreen {
    public static void main(String[] args) {
        String name = "Alex";
        System.out.println(name);
    }
}
