package task01.task0101.task0140;

/*
* Дана переменная number
* Написать программу, которая выводит на экран квадрат этой переменной
*/

public class PrintTheSquareOfNumber {
    public static int number = 25;

    public static void main(String[] args) {
        System.out.println("The square of " + number + " is: " + (number*number));
    }
}
